<?php
/**
 * Функция проверяет что каждая переменная полученная из формы имеет значение.
 * @param array $arrForm - массив переменных полученных из формы.
 * @return bool Если все переменные имеют значение возвращается true, иначе false.
 */
function CheckFillForm($arrForm) {
  // Проверяем что каждая переменная имеет значение.
  foreach ($arrForm as $key => $value) {
    if ((!isset($key)) || ($value == '')) {
      return false;
    }
  }
  return true;
}

/**
 * Функция проверяет корректность длины имени пользователя (по умолчанию: мин 5 знаков, максимум 32).
 * @param mixed $login - Имя пользователя.
 * @param int $min - Минимальная длина имени пользователя.
 * @param int $max - Максимальная длина имени пользователя.
 * @return bool Если имя пользователя корректно возвращается true, иначе - false.
 */
function checkLogin($login, $min = 5, $max = 32) {
  // Длина имени пользователя.
  $strLogin = mb_strlen($login);
  // Проверяем совпадает ли длина имени пользователя с заданными значениями.
  if ($strLogin < $min || $strLogin > $max) {
    return false;
  }
  return true;
}

/**
 * Функция проверяет корректность пароля на допустимые символы и его длинну (по умолчанию: мин 10 знаков, максимум 32).
 * Если проходит проверку - true, иначе - false
 * @param mixed $pass - Пароль пользователя.
 * @param int $min - Минимальная длина пароля.
 * @param int $max - Максимальная длина пароля.
 * @return bool Если пароль корректен возвращается true, иначе - false.
 */
function checkPass($pass, $min = 10, $max = 32) {
  // пароль может включать только алфавитные символы, цифры,
  // знаки пунктуации (-!#$%&'()*+,./:;<=>?@[\]_`{|}~),
  // а его длина должна быть в заданных пределах
  if (preg_match("/^[[:alnum:][:punct:]]{" . $min . "," . $max . "}$/", $pass)) {
    return true;
  }
  return false;
}